{
    "posts": [
        {
            "postid": "2",
            "cardTitle": "Applying Like a PM: Experiments, Metrics, and Black Holes",
            "cardDate": "August 5, 2025",
            "cardContent": "<p>As I've started looking for a new role, I naturally felt the need to figure out how things are progressing. In the product management world, we often look to KPIs, or key performance indicators. The basic idea is to track a few things that show whether we're being successful and making progress toward a goal.</p><p>I've started breaking what I'm tracking into two buckets: metrics and KPIs. So far, it's looking something like this:</p><h3>KPIs:</h3><ul><li>Application Rejections %</li><li>Application Interviews %</li><li>Application Interactions % (Rejections + Interviews)</li><li>Social Discussions (# of conversations about possible roles outside of the interview process / networking)</li></ul><p>Job hunting responses and rejections are pretty inexact. There are humans and AI reviewing submissions, some jobs stay open too long, and some are just getting started. So as a starting point, I wanted my KPIs to be high level, easy to digest, and hopefully easy to influence as things move forward.</p><h3>Metrics:</h3><ul><li>Applications Submitted</li><li>Social Events Attended</li><li>Social Outreach (reaching out to my network and friends)</li></ul><p>Generally, I view how many events I attend or applications I submit as just a count. These don't really gauge success; they're more generalized tallies of activity. For now, they're just informational.</p><p>So far, rejections are the only thing driving any data. That's thanks to slow response times and, for lack of a better term, the black hole of nonresponses that applications tend to disappear into. I've been reading \"Project Hail Mary\" lately, and space feels like a fitting theme. My current rejection rate is around 20 percent, meaning 80 percent of applications are in limbo, or on the other side of the black hole in another dimension.</p><p>Still, I've got a place to start, and that's something. It got me thinking, where can I experiment from here?</p><p>Lately, I've been wondering about ATS systems and how every application must look the same on the other end.</p><p>What if I tried using all capitals with my name, like \"MARK HANSEN\"?</p><p>How about if I used my full legal name with \"Jr.\" at the end?</p><p>What if I gave myself some pizazz and used something like \"*** Mark Hansen, PM ***\" in a name field?</p><p>Would I stand out, and more importantly, would that attention help or hurt? These are the little tests I am looking to start trying out.</p><p>I've also been thinking a bit about the types of companies I'm applying to, their size, revenue, age, and so on. An item on my backlog (yeah, I created one) is building out a target profile of what the ideal company looks like. Hopefully, once I decide what a good fit looks like, I can tailor experiments like this toward the places that align with my goals.</p><p>So that's my homework for the week: define my ideal employer persona and start experimenting with how I apply to see if I can move the needle a bit.</p><p>In the meantime, if you're looking for a Product Manager, you don't need to wait for the end of this experiment. I'd love to chat now. Links and contact info are at the top!</p>"
        },
        {
            "postid": "1",
            "cardTitle": "Building Myself as a Product",
            "cardDate": "July 29, 2025",
            "cardContent": "<p>After nine years with Accusoft and Docubee, both companies have been acquired and it's time to look forward to the next step in my career. I'm beyond appreciative of the many people I was able to work with and learn from over the last near decade. Accusoft and Docubee were filled with talented, smart, and kind people pushing to make the best products possible. A special thanks to Jack Berlin and his leadership team who fostered innovation and cultivated talent here in Tampa.</p><p>With that said, I've done a great deal of thinking about how to embark on the job search and find my place in a new organization. Considering the tough job market, what better way to tackle that problem than to apply the years of experience taking new products to market and shift it to something more personal, myself.</p><p>With so many tools at my disposal, it felt like a natural fit to take these lessons and apply them to my job search. What is my product market fit? What KPIs and metrics can I use to track progress? What is my target persona? Do I need a backlog for this? (I do love a nice backlog.)</p><p>For now, I've started with the basics, applying for roles that are interesting and where I feel I would bring value. Right now I've been tracking basic metrics, submittals, rejections, interviews, dates, etc. The last few weeks have been dealing with a transition to the new organization and the chaos that goes with that. This week I plan to reflect on what is working well and what isn't and from there start applying what I can from the PM world to the job hunt.</p><p>If you're out there looking or just want to follow along, feel free to add me on LinkedIn if you haven't already, and if you have ideas I would love to hear them as well!</p>"
        }
    ]
}